{"format": "graph-model", "generatedBy": "2.3.1", "convertedBy": "TensorFlow.js Converter v2.6.0", "userDefinedMetadata": {"signature": {"inputs": {"input_1:0": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "400"}, {"size": "400"}, {"size": "3"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "400"}, {"size": "400"}, {"size": "3"}]}}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_5/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_5/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_5/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_5/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_5/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_5/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_9", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}, {"size": "3"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_4/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_4/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_4/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_4/stack/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_4/stack/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_4/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_7", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}, {"size": "32"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_3/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_3/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_3/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_3/stack/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_3/stack/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_3/stack/3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "unknown_5", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}, {"size": "64"}, {"size": "128"}]}}}}}, {"name": "unknown", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "32"}]}}}}}, {"name": "unknown_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}}}, {"name": "unknown_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_4", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "unknown_6", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "unknown_8", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_10", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "400"}, {"size": "400"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/cvae_1/sequential_2/conv2d_3/Relu", "op": "_FusedConv2D", "input": ["input_1", "unknown", "unknown_0"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/cvae_1/sequential_2/max_pooling2d_3/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/cvae_1/sequential_2/conv2d_3/Relu"], "attr": {"strides": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/cvae_1/sequential_2/conv2d_4/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/cvae_1/sequential_2/max_pooling2d_3/MaxPool", "unknown_1", "unknown_2"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "epsilon": {"f": 0.0}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/cvae_1/sequential_2/max_pooling2d_4/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/cvae_1/sequential_2/conv2d_4/Relu"], "attr": {"strides": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/cvae_1/sequential_2/conv2d_5/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/cvae_1/sequential_2/max_pooling2d_4/MaxPool", "unknown_3", "unknown_4"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/cvae_1/sequential_2/max_pooling2d_5/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/cvae_1/sequential_2/conv2d_5/Relu"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_3/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/cvae_1/sequential_2/max_pooling2d_5/MaxPool"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_3/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_3/Shape", "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_3/strided_slice/stack", "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_3/strided_slice/stack_1", "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_3/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_3/stack", "op": "Pack", "input": ["StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_3/strided_slice", "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_3/stack/1", "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_3/stack/2", "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_3/stack/3"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "4"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_3/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_3/stack", "unknown_5", "StatefulPartitionedCall/cvae_1/sequential_2/max_pooling2d_5/MaxPool"], "attr": {"explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_3/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_3/conv2d_transpose", "unknown_6"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_3/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_3/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_4/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_3/Relu"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_4/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_4/Shape", "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_4/strided_slice/stack", "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_4/strided_slice/stack_1", "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_4/strided_slice/stack_2"], "attr": {"ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_4/stack", "op": "Pack", "input": ["StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_4/strided_slice", "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_4/stack/1", "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_4/stack/2", "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_4/stack/3"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "4"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_4/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_4/stack", "unknown_7", "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_3/Relu"], "attr": {"data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_4/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_4/conv2d_transpose", "unknown_8"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_4/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_4/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_5/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_4/Relu"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_5/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_5/Shape", "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_5/strided_slice/stack", "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_5/strided_slice/stack_1", "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_5/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_5/stack", "op": "Pack", "input": ["StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_5/strided_slice", "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_5/stack/1", "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_5/stack/2", "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_5/stack/3"], "attr": {"N": {"i": "4"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_5/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_5/stack", "unknown_9", "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_4/Relu"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_5/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_5/conv2d_transpose", "unknown_10"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_5/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_5/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_5/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 440}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_5/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_5/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_5/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_5/stack/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_5/stack/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_5/stack/3", "shape": [], "dtype": "int32"}, {"name": "unknown_9", "shape": [2, 2, 3, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_4/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_4/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_4/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_4/stack/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_4/stack/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_4/stack/3", "shape": [], "dtype": "int32"}, {"name": "unknown_7", "shape": [2, 2, 32, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_3/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_3/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_3/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_3/stack/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_3/stack/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/cvae_1/sequential_3/conv2d_transpose_3/stack/3", "shape": [], "dtype": "int32"}, {"name": "unknown_5", "shape": [2, 2, 64, 128], "dtype": "float32"}, {"name": "unknown", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "unknown_0", "shape": [32], "dtype": "float32"}, {"name": "unknown_1", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "unknown_2", "shape": [64], "dtype": "float32"}, {"name": "unknown_3", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "unknown_4", "shape": [128], "dtype": "float32"}, {"name": "unknown_6", "shape": [64], "dtype": "float32"}, {"name": "unknown_8", "shape": [32], "dtype": "float32"}, {"name": "unknown_10", "shape": [3], "dtype": "float32"}]}]}